app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE (name like '%j%')
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE (name like '%sw')
SELECT "employees".* FROM "employees" WHERE (emp_id like '%tesyasd dsa dsa ')
SELECT  "employees".* FROM "employees" WHERE (name like '%swaz') LIMIT ?  [["LIMIT", 11]]
---
  def get_emplyee_info
    puts params
    @employee = Employee.where('name like ?', "%#{params[:name]}") if params[:name].present?
    @employee = Employee.where('emp_id like ?', "%#{params[:emp_id]}") if params[:emp_id].present?
    @employee = Employee.where('emp_roll like ?', "%#{params[:emp_roll]}") if params[:emp_roll].present?
    if @employee.present?
      render json: { data: @employee.first }

INSERT INTO "employees" ("name", "emp_id", "emp_roll", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "swaz "], ["emp_id", "123456789"], ["emp_roll", "98901350"], ["created_at", "2018-11-15 13:12:30.194698"], ["updated_at", "2018-11-15 13:12:30.194698"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "swaz"], ["updated_at", "2018-11-15 13:33:45.983366"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)